# Dict01.py

# Dictionary(사전) <- key:value
# keys(), values(), items()

a = {10, 20, 30}    # Set --> Set()
b = {}              # 빈딕
c = {10:'사과', 20:'배', 30:'토마토'}

print(type(a), type(b), type(c))

print(c.keys())
print(c.values())
print(c.items())

print("{}\n{}\n{}".format(c.keys(), c.values(), c.items()))

print(c[10])
c[20] = '포도'
c[40] = '사과'

print(id(c[10]), id(c[40]))


############################

직원01 = {'이름' : '홍길동',
          '사번' : 1001,
          '자격증' : ['운전', '한국사', '컴활']}
print(직원01)



학생01 = {'이름' : '홍길동',
          '학번' : 1001,
          '과목별점수' : {'국어':67, '수학':78, '영어':17}}

학생02 = {'이름' : '연아김',
          '학번' : 1002,
          '과목별점수' : {'국어':99, '수학':32, '영어':88}}

학생03 = {'이름' : '이승엽',
          '학번' : 1003,
          '과목별점수' : {'국어':15, '수학':12, '영어':98}}

학생들 = [학생01, 학생02, 학생03]

# 첫번째 학생의 학번은?
print(학생들[0]['학번'])

# 두번째 학생의 영어점수는?
print(학생들[1]['과목별점수']['영어'])
